<a href="https://colab.research.google.com/github/yirouleh/cs167notes/blob/main/Day03_exercises-titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

An example of a markdown cell<br>
Author: <b>Yi Rou Leh</b><br>
Date: September 7, 2021
# Python and Pandas Exercises

Before you begin, make sure you download the data from Blackboard and put it in your Google Drive where you know how to find it (preferably in a datasets folder).

In [ ]:
#selecting columns in dataframes
import pandas
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
titanic = pandas.read_csv("/content/drive/MyDrive/CS167/datasets/titanic.csv")
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
# what is the data type of titanic?
print(type(titanic))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
# what are the features (column titles) of the titanic dataset?
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [ ]:
# display only the 'embark_town' column of the titanic data
titanic.embark_town
#or
titanic["embark_town"]

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [ ]:
# what is the data type of the result of the previous cell? 
print(type(titanic.embark_town))

<class 'pandas.core.series.Series'>

In [ ]:
# what is the "shape" of the data frame?
print(titanic.shape)

(891, 15)

In [ ]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data;
# verify that your subset has 20 rows

subset = titanic[-20:]
print(subset)

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
871         1       1  female  47.0  ...     D  Southampton    yes  False
872         0       1    male  33.0  ...     B  Southampton     no   True
873         0       3    male  47.0  ...   NaN  Southampton     no   True
874         1       2  female  28.0  ...   NaN    Cherbourg    yes  False
875         1       3  female  15.0  ...   NaN    Cherbourg    yes   True
876         0       3    male  20.0  ...   NaN  Southampton     no   True
877         0       3    male  19.0  ...   NaN  Southampton     no   True
878         0       3    male   NaN  ...   NaN  Southampton     no   True
879         1       1  female  56.0  ...     C    Cherbourg    yes  False
880         1       2  female  25.0  ...   NaN  Southampton    yes  False
881         0       3    male  33.0  ...   NaN  Southampton     no   True
882         0       3  female  22.0  ...   NaN  Southampton     no   True
883         0       2    male  28.0  ...   NaN  Southampton     no   True
884         0       3    male  25.0  ...   NaN  Southampton     no   True
885         0       3  female  39.0  ...   NaN   Queenstown     no  False
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[20 rows x 15 columns]

In [ ]:
# use loc to print out the data for passenger 890 on the titanic dataframe
# use iloc to print out the data for passenger 890 on the subest dataframe

print(titanic.loc[890])
print(subset.iloc[19])

survived                0
pclass                  3
sex                  male
age                    32
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object
survived                0
pclass                  3
sex                  male
age                    32
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

In [ ]:
# use a markdown cell; describe the difference between loc and iloc

Loc is label-based, we need to specify rows and columns based on their row a column labels.

iLoc is integer position-based, so you have to specify rows and columns by their integer position values

In [ ]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with
# a 'embark_town' that is "Queenstown"
# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using 
# the .copy() function

queenstown_subset = titanic[(titanic['embark_town'] == "Queenstown")]
print(queenstown_subset)

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
5           0       3    male   NaN  ...   NaN   Queenstown     no   True
16          0       3    male   2.0  ...   NaN   Queenstown     no  False
22          1       3  female  15.0  ...   NaN   Queenstown    yes   True
28          1       3  female   NaN  ...   NaN   Queenstown    yes   True
32          1       3  female   NaN  ...   NaN   Queenstown    yes   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
790         0       3    male   NaN  ...   NaN   Queenstown     no   True
825         0       3    male   NaN  ...   NaN   Queenstown     no   True
828         1       3    male   NaN  ...   NaN   Queenstown    yes   True
885         0       3  female  39.0  ...   NaN   Queenstown     no  False
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[77 rows x 15 columns]

In [ ]:
# how many passengers are in queenstown_subset?
queenstown_subset.shape[0]

77

In [ ]:
# what is the average fare for all of those in the queenstown_subset?
queenstown_subset.fare.mean()

13.276029870129872

In [ ]:
# what is the average age for all of those in the queenstown_subset?
# do all of the passengers have an age recorded? What is recorded if there is no age?
print(queenstown_subset.age.mean())
# not all of the passengers haev an age recorded. It is recorded as NaN which indicates an empty cell

28.089285714285715

In [ ]:
# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

unique(): return unique values in the index; it is returned in order of appearance, this does not sort.

mean(): return the mean of the values over the requested axis

isnull(): detect missing values; return a boolean same-sizedobject indicating if the values are NA values.

fillna(): Fill NA/NaN values with the specific value.

In [ ]:
# give examples of your use of unique(), mean(), median(), isnull()

queenstown_subset.age.isnull()

5       True
16     False
22     False
28      True
32      True
       ...
790     True
825     True
828     True
885    False
890    False
Name: age, Length: 77, dtype: bool

In [ ]:
# in the queenstown_subet dataframe
# for each row that does not have an age recorded, replace the NaN value with the calculated average
# hint: don't use a loop; it can be done in 1 line of code using fillna()
queenstown_subset2 = queenstown_subset.copy()
queenstwon_subset2.age = queenstown_subset.age.fillna(queenstown_subset.age.mean(), inplace=True)
queenstown_subset2

/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:4536: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  downcast=downcast,

     survived  pclass     sex        age  ...  deck  embark_town  alive  alone
5           0       3    male  28.089286  ...   NaN   Queenstown     no   True
16          0       3    male   2.000000  ...   NaN   Queenstown     no  False
22          1       3  female  15.000000  ...   NaN   Queenstown    yes   True
28          1       3  female  28.089286  ...   NaN   Queenstown    yes   True
32          1       3  female  28.089286  ...   NaN   Queenstown    yes   True
..        ...     ...     ...        ...  ...   ...          ...    ...    ...
790         0       3    male  28.089286  ...   NaN   Queenstown     no   True
825         0       3    male  28.089286  ...   NaN   Queenstown     no   True
828         1       3    male  28.089286  ...   NaN   Queenstown    yes   True
885         0       3  female  39.000000  ...   NaN   Queenstown     no  False
890         0       3    male  32.000000  ...   NaN   Queenstown     no   True

[77 rows x 15 columns]

In [ ]:
# load in the iris data
iris = pandas.read_csv("/content/drive/MyDrive/CS167/datasets/irisData.csv")
iris.head()

   sepal length  sepal width  petal length  petal width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [ ]:
# what is the median sepal width of just the Setosas?
sentosas = iris[iris['species'] == 'Iris-setosa']
sentosas['sepal width'].median()

3.4

In [ ]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?
big_petal_versicolors = iris[(iris['species']=='Iris-versicolor')&(iris['petal length']>4)]
big_petal_versicolors['sepal width'].mean()

2.902941176470588